{"meta":{"title":"Jason的博客","subtitle":"欢迎来到我的博客！","description":"我的个人博客","author":"Jason","url":"https://jason006964.github.io","root":"/"},"pages":[{"title":"","text":"menu: Index: url: &#x2F; icon: fas fa-home Tags: url: &#x2F;tags icon: fas fa-tags Categories: url: &#x2F;categories icon: fas fa-bookmark Archives: url: &#x2F;archives icon: fas fa-archive About: url: &#x2F;about icon: fas fa-user-circle-o Friends: url: &#x2F;friends icon: fas fa-address-book Medias: icon: fas fa-list children: - name: Music url: &#x2F;music icon: fas fa-music - name: Movies url: &#x2F;movies icon: fas fa-film - name: Books url: &#x2F;books icon: fas fa-book - name: Galleries url: &#x2F;galleries icon: fas fa-image","path":"index.html"},{"title":"contact","text":"","path":"contact/index.html"},{"title":"404","text":"","path":"404.html"},{"title":"about","text":"","path":"about/index.html"},{"title":"friends","text":"","path":"friends/index.html"},{"title":"categories","text":"","path":"categories/index.html"},{"title":"tags","text":"","path":"tags/index.html"}],"posts":[{"title":"uniq","text":"U家面试准备作为一名实习生，在优衣库门店的实习期间，我积极参与或完成店长分配的各项工作，积累了丰富的零售和客户服务经验。 实习的主要工作为协助店长进行财务总结，参与收支统计和报表整理，提高了对门店财务状况的了解；积极参与接待客人，提供专业、友好的服务，解答客户疑问，提高了客户满意度；参与仓库整理和衣物陈列工作，确保货品有序、整洁陈列，提高了店内商品的可见性。完成收银工作，引导客户进行线上支付，高效处理交易，保证顾客结账流程的顺畅； 完成打包装订的线上订单，保证订单准确无误地送达客户手中；参与卖场场地的清洁工作，保持店内整洁有序的环境；与同事协同工作，共同完成店内各项任务，增强了团队协作和沟通能力；通过积极的客户服务，成功提升了客户满意度和忠诚度。 这段实习经历不仅加深了我对零售行业的理解，还锻炼了我的团队合作和服务技能。它为我奠定了扎实的实际工作基础，使我更好地适应各种工作环境。 自我介绍， 店长你好，我叫欧子杰，来自广东工业大学信息与计算科学专业，今年21岁 本人在校的摄影协会担任过部长到主席，期间组织和领导过几场比较大型的校内活动，校内的机构经历充分锻炼了我的管理能力和领导能力，在2022年我也在优衣库的店铺实习过两个月时间，这段实习经历让我对优衣库从简单的了解到深入地体验和了解到了优衣库的企业文化，企业理念，本身优衣库是我比较喜欢的一个品牌，这段实习经历也让我感受到了优衣库店铺内团队的良好氛围，在团队和工作中很有认同感和成就感，让我更加的热爱优衣库这个企业 以上是我的个人介绍，谢谢 优衣库的企业背书：成立1963年，内在含义时指通过摒弃不必要装潢装饰的仓储型店铺，采用超市型的自助购物方式，以合理可信的价格提供顾客希望的产品 服适人生，精准定位，与时俱进 问题： 为什么选择优衣库：优衣库本身是我很喜欢的一个品牌，优衣库的产品设计简约，版型很好，性价比高，在我认识的品牌里是很特别的存在，给我印象比较深的产品有星球大战，加州本土品牌联名，芝麻街联名ut，便宜耐穿颜值高的摇粒绒外套，白山联名的棉服外套，到最近和engineer garments联名的夹克等等，我在优衣库买过的服饰产品几乎可以覆盖了我的一年四季，另外优衣库本身是一家很优秀的日企，经历过两个月的实习，我能感受到优衣库本身管理模式规范，团队氛围良好，并且我也很认同服适人生的企业理念，希望能在从店员做起的过程当中提升自己的职业素养，抗压能力和业务能力 经常逛优衣库吗？印象：经常逛，但逛的店不固定，比较多的是广州的k11，顺德大良的万达店 员工很热情，服务顾客的态度很好，经常能看到店员之间在卖场相互呼叫帮忙，店员不会去做导购，顾客可以比较轻松比较自由地去选择，卖场很干净整洁，陈列整齐分区清晰，衣服简约但是不失设计，受众广，好搭配 如何理解优衣库“服适人生”的理念：我对服适人生的理解就是：服饰的选择和搭配，也就是现在常说的穿搭体现和传达是对人生和生活的态度，服饰人生就是让更多人的生活有更多丰富多彩可选择的服装，服饰人生是优衣库的核心企业理念，贯穿在各个部门的工作和商品诞生的各个环节，服装是服务于人的，人才是主角 为什么选择umc：管理团队年轻化，有活力，充满热情，晋升机制透明公正，薪资待遇优渥，充分锻炼个人能力，为未来发展助力 你认为作为销售最大的困难在于什么： 你的专业与umc并不对口为什么要来umc 对umc的了解，如何看待前期做基础工作：umc中文全称是优衣库经营管理培训生，工作内容是先从最基础的店铺工作做起，并且全面学习经营管理业务，慢慢成长并可以辅助店铺运营管理，从umc到店长再到区域经理等。 店长这个工作最吸引我的地方：喜欢领导和统筹这个角色，通过自己的努力让店铺销量更高运作更流畅团队氛围更好，很享受通过自己不断努力换取回报的这个过程，有明确的目标和指定严密的经营计划，带领店铺迅速成长和最大程度提升店铺经济效益 你认为店长需要具备哪些技能素质：强大的抗压能力，沟通能力表达能力，擅长学习和有强大的执行力，有强大的管理能力和领导能力 如果当上店长，店铺有很多员工，自己怎样去管理这么多员工：首先创造良好融洽的团队氛围，多和员工沟通，同时也要有作为店长的权威和领导力，要有强大的执行力，严格遵守人员管理制度的规范，包括出勤交接班，排班，加强人员专业技能培训，包括销售，整理卖场等业务能力 在优衣库实习中觉得最困难的事是：当顾客之间发生矛盾或者顾客和店铺员工发生矛盾时，首先去安抚顾客的情绪，但是还是让我觉得比较困难 实习有没有遇到什么事让你觉得很感动，很印象深刻：作为初来乍到的新员工收到其他员工的thanks卡，还有其他老员工很照顾新员工，当我有不懂得或者不清楚某一款产品在哪里的时候都很乐意为我解答 店铺运营存在的问题，如果你是店长你会怎么解决这些问题：自主付款设置在收银台旁边，而顾客多的时候会不好管理，可能存在插队起冲突或者对付款流程不熟悉需要求助店员引导的情况，这个时候店员会比较独木难支，建议：首先将收银台和自助收银划分为两个区域，其次每一个自助收银旁边有袋子提供，这样原来取袋子整理衣服的桌子不会因顾客太多而 你觉得umc岗位比其他员工更快晋升的原因是什么 为什么选择优衣库，能为优衣库带来什么：本身很喜欢优衣库这个牌子，是一个既有设计也有合适的价格的性价比之选，之前做过优衣库的实习，很喜欢优衣库店铺的氛围，并且u有比较透明公正的晋升制度，薪资待遇水平也很合适，从店员开始学习锻炼，也有利于提升个人能力和加深业务理解 对优衣库文化有什么了解，优衣库的文化理念，优衣库为什么能成功：有一些基本的了解，如ut设计的理念：让艺术品进入大众，品牌理念服饰人生，让所有人的生活有更加丰富多彩的服装，服装服务人，人才是人生的主角，为什么能成功，危机意识和创新意识兼有，首先优衣库的经营模式在早期是比较新颖的，在发展的过程中与时俱进，坚持服饰人生的设计理念，设计能力出众，性价比高，吸引到的年轻人多同时受众面很广 接下来去总部选择什么方向 umc需要什么特质 之前工作遇到什么困难 自己的优缺点，怎么改进：性格外向热情，表达能力比较强。做事认真有耐心，有时间观念，有较强地抗压能力；缺点是有时候不擅长拒绝别人，有的时候同事需要帮忙我都会去，可能会影响到本身的工作进度，另外客人有的不合理的要求我可能会不好意思拒绝（拆标洗了没有发票缺要求退货等），只能去求助其他老店员 社团经历给你带来什么与优衣库契合的点 对零售行业的了解：零售行业是一个不断变化和发展的领域，目前零售业态有多元化趋势。作为管理者必须具备敏锐的市场洞察力，有效和与时俱进的经营模式和不断创新的精神，零售的核心角色是消费者和商家，消费者的核心诉求是产品体验，商家服务体验等，商家看重经济效益，从我作为一个消费者的视角来看，零售行业从线下逐渐转向线上，但是线上无法实在的感受的缺点需要线下来弥补，线上和线下的结合的新经营模式带来更好的消费体验，这也说明零售业是一直在变化且变化很迅速的行业，制定与时俱进的经营模式和不断创新的精神是在零售行业中脱颖而出的关键 作为顾客你认为店铺还有什么可以改进的地方 进入优衣库以后的职业方向，职业规划：在进入优衣库的初期阶段，学习和完成店铺基础工作积累经营，同时学习管理经营工作，计划在一年半到两年内成为店长，并成为一个所带领团队氛围融洽，有温度的领导人，接下来的一年到两年内争取海外的发展机会，熟悉海内外零售市场和提升自身的竞争力，冲击大区经理 你说你不喜欢实习重复的工作，如果成为umc天天需要做重复的基础业务你能接受吗？首先未来作为店长有培训员工的义务 你只有自己做够好才有资格培训他们 包括我有了解到一位23umc想离职原因是因为他们店长脱离基础业务太久 不能具有同理心的管理他们 所以我觉得一直去学习 熟悉这些基础业务是很有必要的…这里我回答用的底层逻辑是我之前准备的你怎么看待umc的工作以及做基础业务的必要性（前期就是从学习基础业务，比如清理店铺。整理货架，叠衣服，缝补衣服等等开始，这个过程是一个有针对性的培训过程，是一个学习者的角色。旨在培养未来的店长和更高层次的管理人员。UMC身为未来店长，有义务培训和指导员工，通过前期学习基础业务，可以更有针对性地教导员工，建立高效的工作流程和规范操作。此外，通过亲身学习基础业务，UMC能更深入地了解员工的工作情况，更具同理心地管理和领导团队）","path":"2023/12/07/uniq/"},{"title":"关于centOS的docker下载安装流程","text":"0.安装Docker Docker 分为 CE 和 EE 两大版本。CE 即社区版（免费，支持周期 7 个月），EE 即企业版，强调安全，付费使用，支持周期 24 个月。 Docker CE 分为 stable test 和 nightly 三个更新频道。 官方网站上有各种环境下的 安装指南，这里主要介绍 Docker CE 在 CentOS上的安装。 1.CentOS安装DockerDocker CE 支持 64 位版本 CentOS 7，并且要求内核版本不低于 3.10， CentOS 7 满足最低内核的要求，所以我们在CentOS 7安装Docker。 1.1.卸载（可选）如果之前安装过旧版本的Docker，可以使用下面命令卸载： 1234567891011yum remove docker \\ docker-client \\ docker-client-latest \\ docker-common \\ docker-latest \\ docker-latest-logrotate \\ docker-logrotate \\ docker-selinux \\ docker-engine-selinux \\ docker-engine \\ docker-ce 1.2.安装docker首先需要大家虚拟机联网，安装yum工具 123yum install -y yum-utils \\ device-mapper-persistent-data \\ lvm2 --skip-broken 然后更新本地镜像源： 12345678# 设置docker镜像源yum-config-manager \\ --add-repo \\ https://mirrors.aliyun.com/docker-ce/linux/centos/docker-ce.repo sed -i &#x27;s/download.docker.com/mirrors.aliyun.com\\/docker-ce/g&#x27; /etc/yum.repos.d/docker-ce.repoyum makecache fast 然后输入命令： 1yum install -y docker-ce docker-ce为社区免费版本。稍等片刻，docker即可安装成功。 1.3.启动dockerDocker应用需要用到各种端口，逐一去修改防火墙设置。非常麻烦，因此建议大家直接关闭防火墙！ 启动docker前，一定要关闭防火墙后！！ 启动docker前，一定要关闭防火墙后！！ 启动docker前，一定要关闭防火墙后！！ 1234# 关闭systemctl stop firewalld# 禁止开机启动防火墙systemctl disable firewalld 通过命令启动docker： 12345systemctl start docker # 启动docker服务systemctl stop docker # 停止docker服务systemctl restart docker # 重启docker服务 然后输入命令，可以查看docker版本： 1docker -v 如图： 1.4.配置镜像加速docker官方镜像仓库网速较差，我们需要设置国内镜像服务： 参考阿里云的镜像加速文档：https://cr.console.aliyun.com/cn-hangzhou/instances/mirrors 2.CentOS7安装DockerCompose2.1.下载Linux下需要通过命令下载： 12# 安装curl -L https://github.com/docker/compose/releases/download/1.23.1/docker-compose-`uname -s`-`uname -m` &gt; /usr/local/bin/docker-compose 如果下载速度较慢，或者下载失败，可以使用课前资料提供的docker-compose文件： 上传到/usr/local/bin/目录也可以。 2.2.修改文件权限修改文件权限： 12# 修改权限chmod +x /usr/local/bin/docker-compose 2.3.Base自动补全命令：12# 补全命令curl -L https://raw.githubusercontent.com/docker/compose/1.29.1/contrib/completion/bash/docker-compose &gt; /etc/bash_completion.d/docker-compose 如果这里出现错误，需要修改自己的hosts文件： 1echo &quot;199.232.68.133 raw.githubusercontent.com&quot; &gt;&gt; /etc/hosts 3.Docker镜像仓库搭建镜像仓库可以基于Docker官方提供的DockerRegistry来实现。 官网地址：https://hub.docker.com/_/registry 3.1.简化版镜像仓库Docker官方的Docker Registry是一个基础版本的Docker镜像仓库，具备仓库管理的完整功能，但是没有图形化界面。 搭建方式比较简单，命令如下： 123456docker run -d \\ --restart=always \\ --name registry \\ -p 5000:5000 \\ -v registry-data:/var/lib/registry \\ registry 命令中挂载了一个数据卷registry-data到容器内的&#x2F;var&#x2F;lib&#x2F;registry 目录，这是私有镜像库存放数据的目录。 访问http://YourIp:5000/v2/_catalog 可以查看当前私有镜像服务中包含的镜像 3.2.带有图形化界面版本使用DockerCompose部署带有图象界面的DockerRegistry，命令如下： 123456789101112131415version: &#x27;3.0&#x27;services: registry: image: registry volumes: - ./registry-data:/var/lib/registry ui: image: joxit/docker-registry-ui:static ports: - 8080:80 environment: - REGISTRY_TITLE=传智教育私有仓库 - REGISTRY_URL=http://registry:5000 depends_on: - registry 3.3.配置Docker信任地址我们的私服采用的是http协议，默认不被Docker信任，所以需要做一个配置： 12345678# 打开要修改的文件vi /etc/docker/daemon.json# 添加内容：&quot;insecure-registries&quot;:[&quot;http://192.168.150.101:8080&quot;]# 重加载systemctl daemon-reload# 重启dockersystemctl restart docker","path":"2023/12/06/guan-yu-centos-de-docker-xia-zai-an-zhuang-liu-cheng/"},{"title":"Maven进阶","text":"Mavenmaven进阶分模块开发与设计 将原始模块按照功能拆分为若干个子模块，方便模块之间的相互调用，接口共享 依赖管理 依赖具有传递性 直接依赖 间接依赖 依赖冲突 路径优先：当依赖中出现相同的资源时，层级越深，优先级越低，层级越浅，优先级越高 声明优先：当资源在相同层级被依赖时，配置顺序靠前的覆盖配置顺序靠后的 特殊优先：当同级配置了相同资源的不同版本，后配置的覆盖先配置的 可选依赖 true:隐藏当前工程所依赖的资源，隐藏后对应资源不再具有依赖传递性，即其他模块无法引用这个资源 排除依赖：排除某个依赖 ​ ​ xxx ​ xxx ​ 聚合和继承 聚合（当多个模块之间存在依赖关系时，其中一个模块的更新可能会影响其他的模块的正常运行，所以必须保障工程中与已更新模块关联的模块同步更新，此时可以使用聚合工程来解决批量模块同步构建的问题） 将多个模块组织成一个整体，同时进行项目构建的过程称为聚合 聚合工程：通常是一个不具有业务功能的空工程（有且仅有一个pom文件） 作用：使用聚合工程可以将多个工程编组，通过对聚合工程进行构建，实现对所包含的模块进行同步构建 继承 继承描述的是两个工程间的关系，与java的继承相似，子工程可以继承父工程中的配置信息，常见于依赖关系的继承 ​ 聚合继承的区别 作用 聚合用于快速构建项目 继承用于快速配置项目 相同 聚合与继承的pom.xml文件打包方式均为pom，可以将两种关系制作到同一个pom文件中 聚合和继承均属于设计型模块， 无实际的模块内容 不同 聚合是在当前模块中配置关系，聚合可以感知到参与模块的聚合的模块有哪些 继承是在子模块中配置关系，父模块无法感知哪些子模块继承了自己 属性管理​ 多环境配置与应用​ 跳过测试（执行的项目构建指令必须包含测试生命周期，否则无效果。例如执行compile生命周期，不经过test测试） 细粒度控制跳过测试 指令 私服 私服简介 私服是一台独立的服务器，用于解决团队内部的资源共享与资源同步问题（私服例子：nexus） 私服仓库分类 资源上传与下载 本地仓库配置（修改maven本地配置文件，也就是安装路径的conf文件夹下的setting.xml文件） 工程上传到私服服务器设置（deploy）","path":"2023/12/06/maven-jin-jie/"},{"title":"Hello World","text":"Welcome to Hexo! This is your very first post. Check documentation for more info. If you get any problems when using Hexo, you can find the answer in troubleshooting or you can ask me on GitHub. Quick StartCreate a new post1$ hexo new &quot;My New Post&quot; More info: Writing Run server1$ hexo server More info: Server Generate static files1$ hexo generate More info: Generating Deploy to remote sites1$ hexo deploy More info: Deployment","path":"2023/12/05/hello-world/"}],"categories":[],"tags":[]}